tests/testfiles/set_parameter_values.xml

<?xml version="1.0"?>
<soap:Envelope
    xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/"
    soap:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/"
    xmlns:cwmp="urn:dslforum-org:cwmp-1-0">
      <soap:Header>
        <cwmp:ID soap:mustUnderstand="1">1234</cwmp:ID>
      </soap:Header>
      <soap:Body>
        <cwmp:SetParameterValues>
  	<cwmp:ParameterList>
  	  <cwmp:ParameterValueStruct>
  	    <cwmp:Name>.a.d</cwmp:Name>
  	    <cwmp:Value>a new string</cwmp:Value>
  	  </cwmp:ParameterValueStruct>
  	  <cwmp:ParameterValueStruct>
  	    <cwmp:Name>.a.b.a</cwmp:Name>
  	    <cwmp:Value>54321</cwmp:Value>
  	  </cwmp:ParameterValueStruct>
  	  <cwmp:ParameterValueStruct>
  	    <cwmp:Name>.a.b.b</cwmp:Name>
  	    <cwmp:Value>ZmVkY2JhOTg3NjU0MzIxCg==</cwmp:Value>
  	  </cwmp:ParameterValueStruct>
  	</cwmp:ParameterList>
    <cwmp:ParamterKey>Dummy_Key</cwmp:ParamterKey>
        </cwmp:SetParameterValues>
      </soap:Body>
  </soap:Envelope>
